[
  {
    "id": 1727522996554,
    "title": "CISA cảnh báo về lỗ hổng CVE-2024-38856 trong Apache OFBiz",
    "content": "<p><strong>Cơ quan An ninh Mạng và Cơ sở Hạ tầng của Hoa Kỳ (CISA) đã phát đi cảnh báo khẩn cấp về một lỗ hổng bảo mật đang bị khai thác trong hệ thống quản lý tài nguyên doanh nghiệp mã nguồn mở Apache OFBiz. Lỗ hổng này, được theo dõi dưới mã CVE-2024-38856, đã được thêm vào danh sách các lỗ hổng đã biết bị khai thác (KEV) của CISA.</strong><br><br>CVE-2024-38856 là một lỗ hổng thực thi mã từ xa trước khi xác thực. Lỗ hổng này ảnh hưởng đến các phiên bản Apache OFBiz trước phiên bản 18.12.15, gây ra nguy cơ nghiêm trọng đối với bất kỳ tổ chức nào đang sử dụng các phiên bản phần mềm lỗi thời.</p><p>&nbsp;</p><p>Nguyên nhân gốc rễ của CVE-2024-38856 nằm ở một lỗi trong cơ chế xác thực của Apache OFBiz. Cụ thể, lỗi này cho phép người dùng chưa được xác thực truy cập vào các chức năng thường chỉ dành cho người dùng đã đăng nhập. Sau khi vào được hệ thống, kẻ tấn công có thể khai thác quyền truy cập này để thực thi mã tùy ý trên các hệ thống bị xâm phạm, điều này có thể dẫn đến việc chiếm quyền điều khiển toàn bộ hệ thống.<br><br>Lỗ hổng này nằm trong chức năng xem ghi đè của Apache OFBiz. Điểm yếu nghiêm trọng này làm lộ các điểm cuối quan trọng đối với các kẻ tấn công chưa được xác thực, những người có thể khai thác lỗ hổng bằng cách gửi các yêu cầu được tạo đặc biệt.<br><br>Thêm vào sự cấp bách, các nhà nghiên cứu bảo mật đã công bố mã khai thác proof-of-concept (PoC) cho CVE-2024-38856. Việc mã PoC này có sẵn trên GitHub cung cấp một minh chứng cụ thể về cách khai thác lỗ hổng, làm cho việc tấn công trở nên dễ dàng hơn cho các tác nhân đe dọa.<br><br>Vì mức độ nghiêm trọng cao và việc khai thác đang diễn ra của CVE-2024-38856, CISA đã khuyến nghị mạnh mẽ rằng tất cả các cơ quan liên bang và các tổ chức sử dụng Apache OFBiz nên cập nhật cài đặt của họ lên phiên bản 18.12.15 hoặc mới hơn trước ngày 17 tháng 9 năm 2024. Việc không thực hiện các bản cập nhật này có thể để lại các hệ thống dễ bị tấn công, dẫn đến rủi ro về vi phạm dữ liệu, gián đoạn dịch vụ và các hậu quả nghiêm trọng khác.</p><p>&nbsp;</p><p>&nbsp;</p>",
    "createAt": "2024-09-28T11:29:56.554Z",
    "username": "minhhieu",
    "status": "public",
    "type": "Information"
  },
  {
    "id": 1727523648997,
    "title": "Lỗ hổng RCE nghiêm trọng trong tường lửa SRX Series và thiết bị chuyển mạch EX Series",
    "content": "<p><strong>Juniper Networks đã phát hành các bản cập nhật để khắc phục lỗ hổng thực thi mã từ xa (RCE) quan trọng trong tường lửa SRX Series và thiết bị chuyển mạch EX Series.</strong><br>Đó là lỗ hổng <strong>CVE-2024-21591</strong>, được đánh giá<strong> 9,8 điểm </strong>trên hệ thống tính điểm CVSS.<br><br>Công ty Juniper cho biết: \"Một lỗ hổng out-of-bounds write (ghi dữ liệu ra khỏi phạm vi giới hạn của vùng nhớ) trong J-Web của Juniper Networks Junos OS SRX Series và EX Series cho phép kẻ tấn công sử dụng mạng không xác thực gây ra từ chối dịch vụ (DoS) hoặc thực thi mã từ xa (RCE) và có được đặc quyền root trên thiết bị\".<br><br>Trước đó, Juniper được Hewlett Packard Enterprise (HPE) mua lại với giá 14 tỷ USD. Công ty Juniper đề cập vấn đề gây ra lỗ hổng nói trên là do sử dụng các chức năng không an toàn cho phép tin tặc tùy ý ghi đè lên bộ nhớ.<br><br>Các phiên bản bị ảnh hưởng:<br>&nbsp;</p><ol><li>Các phiên bản hệ điều hành Junos cũ hơn 20.4R3-S9</li><li>Junos OS 21.2 phiên bản cũ hơn 21.2R3-S7</li><li>Junos OS 21.3 phiên bản cũ hơn 21.3R3-S5</li></ol><p>&nbsp;</p><p>Các phiên bản đã khắc phục lỗ hổng: 20.4R3-S9, 21.2R3-S7, 21.3R3-S5, 21.4R3-S5, 22.1R3-S4, 22.2R3-S3, 22.3R3-S2, 22.4R2-S2, 22.4R3, 23.2R1-S1, 23.2R2, 23.4R1 và các phiên bản sau.<br><br>Công ty khuyến cáo người dùng vô hiệu hóa J-Web hoặc hạn chế quyền truy cập chỉ cho phép các máy chủ đáng tin cậy để khắc phục tạm thời lỗ hổng để chờ các bản sửa lỗi được phát hành đầy đủ.<br><br>Ngoài ra, Juniper Networks cũng xử lý một lỗi nghiêm trọng khác trong Junos OS và Junos OS Evolved (CVE-2024-21611, điểm CVSS: 7,5), lỗ hổng này có thể bị khai thác và tấn công DoS.<br><br>Hiện tại chưa có thông tin về việc khai thác các lỗ hổng này trong thực tế, tuy nhiên các lỗ hổng ảnh hưởng đến tường lửa SRX Series và thiết bị chuyển mạch EX Series đã có tiền lệ bị khai khác bởi tin tặc vào năm ngoái.</p>",
    "createAt": "2024-09-28T11:40:48.997Z",
    "username": "minhhieu",
    "status": "public",
    "type": "Information"
  }
]